{
    "lastId": "grph",
    "data": [
        {
            "uid": "cmbn",
            "name": "combinatorics",
            "title": "Комбинаторика",
            "apply": "Комбинаторика используется в криптографии, компьютерных науках, теории кодирования, биоинформатике и многих других областях.",
            "ask": "Знания комбинаторики часто требуются при приеме на работу в области разработки программного обеспечения, особенно в компаниях, занимающихся разработкой алгоритмов и оптимизационных решений.",
            "read": "Подробнее о комбинаторике можно узнать в учебниках по дискретной математике, а также специализированных книгах по комбинаторному анализу."
        },
        {
            "uid": "thrv",
            "name": "probability",
            "title": "Теория вероятностей",
            "apply": "Теория вероятностей находит применение в статистике, страховании, финансовых моделях, квантовой механике, машинном обучении и многих других научных и прикладных областях.",
            "ask": "Знание теории вероятностей востребовано при трудоустройстве в аналитику данных, финансы, страхование, а также в академической сфере.",
            "read": "Учебники по теории вероятностей и математической статистике помогут глубже изучить эту область математики."
        },
        {
            "uid": "algb",
            "name": "algebra",
            "title": "Алгебра",
            "apply": "Алгебра широко применяется в физике, инженерии, криптографии, вычислительной технике и других технических науках.",
            "ask": "Основы алгебры проверяются практически везде, где требуется умение решать уравнения и системы уравнений, включая ИТ-сферу, технические специальности и финансовые профессии.",
            "read": "Для изучения алгебры подойдут базовые курсы высшей математики, специализированные учебники по линейной алгебре и абстрактной алгебре."
        },
        {
            "uid": "stts",
            "name": "statistics",
            "title": "Статистика",
            "apply": "Статистические методы используются в социологии, медицине, экономике, маркетинге, науке и бизнесе для анализа данных и принятия обоснованных решений.",
            "ask": "Знания статистики необходимы специалистам по данным, аналитикам, маркетологам, а также ученым в различных областях.",
            "read": "Обширная литература по статистике доступна в виде учебных пособий, книг по прикладной статистике и специализированной литературы по статистическим методам."
        },
        {
            "uid": "anls",
            "name": "calculus",
            "title": "Математический анализ",
            "apply": "Математический анализ лежит в основе большинства инженерных расчетов, физики, химии, биологии и других естественных наук.",
            "ask": "При трудоустройстве в научные и инженерные сферы знание математического анализа является важным критерием оценки кандидата.",
            "read": "Классическими источниками являются учебники по математическому анализу, дифференциальным и интегральным исчислениям."
        },
        {
            "uid": "grph",
            "name": "graphs",
            "title": "Теория графов",
            "apply": "Теория графов находит применение в телекоммуникациях, транспортной логистике, социальных сетях, компьютерной графике и анализе сетей.",
            "ask": "Вопросы по теории графов часто встречаются при собеседованиях на позиции разработчиков ПО, сетевых инженеров и специалистов по работе с большими данными.",
            "read": "Основные сведения о теории графов можно найти в учебниках по дискретной математике и специализированных монографиях."
        }
    ]
}